

#Fore: Цей атрибут дозволяє змінювати кольори переднього плану (тексту). Він має різні значення, такі як BLACK, RED, GREEN, YELLOW, BLUE, MAGENTA, CYAN, WHITE та RESET. Наприклад, Fore.RED встановлює колір тексту на червоний.

#Back: Цей атрибут дозволяє змінювати кольори фону. Він також має значення, схожі на Fore, такі як BLACK, RED, GREEN, YELLOW, BLUE, MAGENTA, CYAN, WHITE та RESET. Наприклад, Back.GREEN встановлює зелений фон.

#Style: Цей атрибут дозволяє застосовувати стилі до тексту. Значення можуть бути NORMAL (звичайний текст), BRIGHT (яскравий текст), DIM (темний текст), RESET_ALL (скасувати всі стилі). Наприклад, Style.BRIGHT зробить текст яскравішим.